[{"title":"hexo与github page联合建站过程中踩过的坑","date":"2017-01-10T08:15:07.000Z","path":"2017/01/10/hexo联合github-page联合建站过程中踩过的坑/","text":"截止到现在，一直以来的愿望总算达成，虽然距离自己最初的心愿–完全手写一个blog还有很长的路要走。 YAML语法 之前没写过配置文件，这是第一次接触YAML，确实简洁强大。 key: value; 冒号之后有空格 字符串默认不使用引号。如：title: 欢迎来到我的博客 字符串之中包含空格或特殊字符，需要放在引号之中。如：title: ‘hello world’ 文章包含多个标签 123tags:- one- two #表示注释 具体YAML语法请看http://www.ruanyifeng.com/blog/2016/07/yaml.html?f=tt -hexo中相对路径引用的标签插件 当时有疑问的主要是 标签插件,不知道到底应该把图片放在哪里，路径到底是以哪个为根路径。 官方文档中的解释如下当你打开文章资源文件夹功能后，你把一个 example.jpg 图片放在了你的资源文件夹中，如果通过使用相对路径的常规 markdown 语法 ![](/example.jpg) ，它将 不会 出现在首页上。（但是它会在文章中按你期待的方式工作）正确的引用图片方式是使用下列的标签插件而不是 markdown ：``通过这种方式，图片将会同时出现在文章和主页以及归档页中。 现在再看其实很清晰，文档甚至怕使用者看不懂图片的名称都写出来了，然而还是有我这种人不仔细看没看懂。。 资源文件夹指的是当你把资源文件管理功能打开后，即设置_config.yml123post_asset_folder: true每次你通过hexo new article-title命令新建文章时，相对应的会生成一个和文章名称相同的文件夹，这个文件夹就是所谓的资源文件夹，而根路径也就是这个文件夹。比如 这个example.jpg就是直接放在资源文件夹里","tags":[{"name":"技术","slug":"技术","permalink":"http://tinyfirefly.com/tags/技术/"},{"name":"建站","slug":"建站","permalink":"http://tinyfirefly.com/tags/建站/"}]},{"title":"信息的不完全导致安全感的缺失","date":"2017-01-09T12:35:30.000Z","path":"2017/01/09/信息的不完全导致安全感的缺失/","text":"经常会有人说自己没有安全感，那么什么是安全感呢，百度百科对于安全感的基本定义如下： 安全感是对可能出现的对身体或心理的危险或风险的预感，以及个体在应对处事时的有力/无力感，主要表现为确定感和可控感。 从这个基本定义上来看，我们可以从两个方面进行分析：确定感和可控感。确定感和可控感都可以理解为是一种概率的抽象，你自己内心认为这件事确定发生或不发生的概率是多少，可以在你的控制范围内的可能性又是多少。那么分析这种概率我们所依靠的又是什么？信息。 对于信息，它通过信息量，信息的客观性，信息的可信度，信息的价值性等几个属性相互作用，影响我们最终的认知。在和信息学有关的课堂上，不同的老师都会不约而同的问我们同一个问题：“信息量越大，是否意味着对事件的分析或者目标的达成越有利？”老师这么问，答案肯定是否定的。为什么呢？其实在我的印象中，没有哪个老师给了我们一个明确的答案，只是给了我们一个思考的方向，我认为有以下几点原因： 信息量越大，不意味着价值越大。举一个最简单的例子：你去饭店吃饭，希望吃到正宗的法式大餐，但是餐厅服务员却给了你一大摞中国八大菜系的菜品介绍，并且十分热情的挨个讲解给你听。这个信息量相较一般情况已经足够大，但你觉得有价值吗，是否促进了你目标的达成？我想你会恼火的去投诉这个服务员。 信息的数量虽然变大，但信息的来源并没有得到考证，也就是信息的可信度不被认可。在当今这个信息爆炸的时代，垃圾信息大量充斥在我们的生活中，可以说是随处可见：朋友圈里的“一定要看”系列文章，不良媒体的不实或夸大报道……如果信息的数量是由这些无价值甚至虚假的信息组成，那么这对我们分析问题将是一场灾难。 信息的利用需要经过清洗和整理。大量的数据收集上来，首先需要进行的就是清洗，即把不符合要求的数据信息剔除出去，接下来再进行整理，比如归类，排序，简单地比较等。所以虽然信息量大给了我们一定的分析基础，但如果不对信息进行整理和结构化，只是一堆杂乱无章的信息，那对于我们分析问题是没有任何作用的。 前面铺垫了这么多，其实我想说的是安全感也是同样的道理。对于安全感，影响它的因素很多：家庭，成长环境，性格，朋友，恋人，经历等等，正因为可以影响它的因素每个人都会拥有，所以每个人或多或少都会感觉缺乏，我问了我周围的一些朋友，不管性格如何，工作或者学习情况怎样，他们都认为自己缺乏安全感，只是程度不同。但是我们今天不分析以上的这些影响因素，我们今天从信息的角度来分析安全感。 得到有价值信息很难 人们对于不确定的事物总会感觉紧张，甚至焦虑，因为你害怕这种不确定的事物会对你的身心造成伤害，这其实就是一种安全感缺失的表现。 比如你收到了一个公司的面试通知，除非你胸有成竹或者对于结果不care，那么正常的你会感到紧张。试想，这时如果有人给了你明天的面试内容，你的紧张情绪是否会缓解很多。但在现实生活中这是几率很小几乎为零的情况，通常的情况是你漫无目的地在互联网上找各种面试信息，查找和这个公司有关的一切信息，但这些信息对于你的面试有多大的帮助，在面试之前没有人能告诉你。再比如，你爸妈让你去相亲，你们约在一个安静的咖啡馆里。因为是终身大事，你想知道他尽可能多的有价值信息，比如他人品怎样，有没有能力等等，但这些你要怎么得到呢，直接问他？通过媒人？显然通过这些渠道得到的信息都不可能是客观的，而且由于是相亲，你们共同的朋友少之又少，这又给你获得有价值信息增添了阻碍。由于得不到你想了解的信息，你有可能连进一步与他交往了解的机会都不会给双方。其实这样你就会默认他不符合你的要求，同时放大自己在寻找有价值信息过程中遇到的阻碍，进而增加你的不安全感。 不可能得到所有你需要的信息 如果我们可以完全的了解一个事物，那这个事物对我们安全感的消耗就会很低，甚至会增加我们的安全感，但实际上我们不可能完全了解一个人，一件事，任何一点没有被我们了解到的地方，都会成为我们不安全感的来源。 如果一个男生追求你，几乎每时每刻都在和你聊天，但你们在他追求你之前并没有太多交集，只停留在知道有这么一个人的水平，聊天也只是日常的一些无关紧要的话题，并没有涉及人生观、价值观等三观问题。假使这个男生很幽默，也会给你惊喜，长得也过得去。在你们聊了一个月之后他向你表白，你会答应吗？每个人对于这个问题的回答应该不尽相同，回答“会答应”的，最大的理由可能是“爱情就是需要冲动，需要勇敢，需要敢于尝试”。对于你的这个言论，我举双手赞成，但是实际上在对对方没有一定的了解上的冲动和勇敢是一种不负责任的表现，同时也会加重彼此的不安全感。因为情侣是一种相对来说比较亲密的关系，你们可能以后的人生都会和彼此相伴，在对对方没有足够了解的情况下就开始这种亲密关系，会极大地增加矛盾的产生，比如你有洁癖，他十分邋遢；你爱韩剧，他对韩剧嗤之以鼻。随着矛盾的不断累积，你们的关系有可能就会走到尽头，最终break up. 而回答“不会答应”的，不出意外就是出于认为还对对方不太了解的原因了。因为你们的聊天建立在一个虚拟的网络世界，并且没有深入的交流。他对你来说确实具有足够的新鲜感，但同时也让你没有一丝安全感。你不知道他是否具有绅士风度，是否小气，是否自以为是，长相是否真的和照片上一样……你无法完全的了解他这个人，这让你很犹豫要不要答应。如果你本身就是一个很缺乏安全感的人，那么你会倾向于不答应，反之你有可能会答应。不管怎么说，因为没有得到这个人足量的信息，由此加重了你的不安全感，而得到完全的信息数据又是不可能的，所以会导致不同程度的安全感的缺失。 所以从信息角度分析，由于不可能得到完全的信息，每个人都会或多或少的感到安全感的缺失，人们会不自主的选择不断地收集信息来填补这缺失。就像文章刚开始所说，信息量不一定代表价值，在我们忙碌于收集信息的过程中，需要善于从信息中提取有价值的东西，来帮助自己做决策，并且通过接触大量的信息，扩展自己眼界，不断提升修养、寻找生活乐趣，进而遇见更好的自己。","tags":[{"name":"心理学","slug":"心理学","permalink":"http://tinyfirefly.com/tags/心理学/"}]},{"title":"2016--年度总结","date":"2017-01-09T08:31:26.000Z","path":"2017/01/09/年度总结/","text":"","tags":[{"name":"生活","slug":"生活","permalink":"http://tinyfirefly.com/tags/生活/"},{"name":"年度总结","slug":"年度总结","permalink":"http://tinyfirefly.com/tags/年度总结/"}]}]