[{"title":"原生js实现多选框的排序以及可选个数控制","date":"2017-02-20T13:20:39.000Z","path":"2017/02/20/原生js实现多选框的排序以及可选个数控制/","text":"展示页面： http://codepen.io/crystalYY/pen/ggNjQR 主要效果： 最多可选择三项，用户尝试选择第四项时，多选框变为disabled禁用状态 按照用户点击的顺序实时给出已选择的多选框所对应的序号 左下方实时提醒用户当前已选择了几项 实现思路： 设置一个用来存放已经选定的多选框，即obj.checked=true的value的数组checkedArray 效果1实现思路：通过监听每个input的click事件，如果(if)checkedArray.length大于或等于3并且当前所点击的input在这次点击事件之前为未选择（意思是点击之后为选中状态），即checkedArray.length&gt;=3&amp;&amp;currentTarget.checked==true，则设置此次点击无效currentTarget.checked=false,并且通过遍历所有input,将checked==false的设置为禁用状态。(else)除上面已说的情况外的其他情况，则通过判断点击后check==ture还是checked==false分别向checkedArray数组中push当前选中的多选框的value,或者删除数组中和当前取消选中的多选框的value相等的元素。 效果2实现思路：遍历所有input,获取对于的value值，使用indexOf()函数来在checkedArray中定位，不返回-1说明已经被选中，将返回值+1后填入之前写好的span标签内 效果3实现思路：获取checkedArray.length 需要注意的点 考虑到input可能会很多，所以使用了事件委托，把click事件绑定在input的父级上，通过event target的使用完成input上点击事件的绑定 因为input和label标签相互依赖，所以会触发两次点击事件，我们只需要input上的点击事件，防止label的干扰，可以通过判断是否为label,如果是就返回的方法来实现，即 if(tar.nodeName.toLowerCase()==’label’){ return; } 可以改进的地方 循环太多，遍历了很多次input，内存占用大 如果把整个功能封装，可以减少整个项目的代码量，如果是需要做一个问卷系统的话","tags":[{"name":"秋实","slug":"秋实","permalink":"https://crystalyy.github.io/blog/tags/秋实/"},{"name":"JavaScript","slug":"JavaScript","permalink":"https://crystalyy.github.io/blog/tags/JavaScript/"}]},{"title":"hexo与github page联合建站过程中踩过的坑","date":"2017-01-10T08:15:07.000Z","path":"2017/01/10/hexo联合github-page联合建站过程中踩过的坑/","text":"截止到现在，一直以来的愿望总算达成，虽然距离自己最初的心愿–完全手写一个blog还有很长的路要走。 YAML语法之前没写过配置文件，这是第一次接触YAML，确实简洁强大。 key: value; 冒号之后有空格 字符串默认不使用引号。如：title: 欢迎来到我的博客 字符串之中包含空格或特殊字符，需要放在引号之中。如：title: ‘hello world’ 文章包含多个标签 123tags:- one- two #表示注释 具体YAML语法请看http://www.ruanyifeng.com/blog/2016/07/yaml.html?f=tt hexo中相对路径引用的标签插件当时有疑问的主要是 { % asset_img slug [title] %}标签插件,不知道到底应该把图片放在哪里，路径到底是以哪个为根路径。 官方文档中的解释如下 当你打开文章资源文件夹功能后，你把一个 example.jpg图片放在了你的资源文件夹中，如果通过使用相对路径的常规 markdown 语法 ![](/example.jpg) ，它将 不会 出现在首页上。（但是它会在文章中按你期待的方式工作）正确的引用图片方式是使用下列的标签插件而不是 markdown ： { % asset_img example.jpg This is an example image %}通过这种方式，图片将会同时出现在文章和主页以及归档页中。 现在再看其实很清晰，文档甚至怕使用者看不懂图片的名称都写出来了，然而还是有我这种人不仔细看没看懂。。 资源文件夹指的是当你把资源文件管理功能打开后，即设置_config.yml123post_asset_folder: true每次你通过hexo new article-title命令新建文章时，相对应的会生成一个和文章名称相同的文件夹，这个文件夹就是所谓的资源文件夹，而根路径也就是这个文件夹。比如 { % asset_img example.jpg This is an example image %}这个example.jpg就是直接放在资源文件夹里 github上出现灰色文件对于这个问题，我找到了原因但依然没有很好地解决办法。 问题产生的原因是由于我作死的直接从原作者的github上pull下来了yilia主题，并且pull的当前文件夹就是hexo的themes文件夹，导致yilia文件夹本身就是一个本身已经初始化并且有远成仓库的本地Git仓库。 用git remote show origin来查看远程仓库信息，也是yilia作者的Git远程仓库地址。虽然我后来又在blog文件夹（包含yilia文件夹）init了一个Git本地仓库，并和我github上的远程仓库相连，但我依然得不到yilia文件夹的编辑权，除非到yilia文件夹下，但就算你此时push也是push到yilia作者的仓库里。 查了一些资料，说是yilia这种情况就属于blog的子模块了，子模块是什么鬼，第一次听说。子模块资料但我在yilia文件夹里搜索了一下，并没有.gitmodules和 pod-library 文件，所以这应该不是子模块。 那是什么，我又找了一通资料。觉得主要原因是yilia本身也是一个初始化的Git仓库。那取消初始化会不会就正常了，可以执行git rm rf .git或直接手动删除.git文件。发现yilia文件确实和blog保持了一致，远程仓库和本地分支都一致，但奈何github上依然是灰色文件不能操作。。 好吧，最后我无奈的把yilia先复制到桌面上，然后add commit push，再把桌面上的yilia恭恭敬敬的又请回了themes文件夹，接着add commit push，再去看github，竟然可操作了。。。 简单粗暴但有效。 最后提醒一句：再下载主题的时候别再为了一时方便直接pull主题到博客本身的themes文件夹下了，后续造成的不方便不知道要花费多少时间。当然如果你不打算把hexo的所有配置文件都上传到GitHub上，那倒没太大问题，不过万一哪天你电脑突然挂了呢。。。还得重新再搭建一次，所以还是尽早备份吧","tags":[{"name":"秋实","slug":"秋实","permalink":"https://crystalyy.github.io/blog/tags/秋实/"},{"name":"建站","slug":"建站","permalink":"https://crystalyy.github.io/blog/tags/建站/"}]},{"title":"信息的不完全导致安全感的缺失","date":"2017-01-09T12:35:30.000Z","path":"2017/01/09/信息的不完全导致安全感的缺失/","text":"经常会有人说自己没有安全感，那么什么是安全感呢，百度百科对于安全感的基本定义如下： 安全感是对可能出现的对身体或心理的危险或风险的预感，以及个体在应对处事时的有力/无力感，主要表现为确定感和可控感。 从这个基本定义上来看，我们可以从两个方面进行分析：确定感和可控感。确定感和可控感都可以理解为是一种概率的抽象，你自己内心认为这件事确定发生或不发生的概率是多少，可以在你的控制范围内的可能性又是多少。那么分析这种概率我们所依靠的又是什么？信息。 对于信息，它通过信息量，信息的客观性，信息的可信度，信息的价值性等几个属性相互作用，影响我们最终的认知。在和信息学有关的课堂上，不同的老师都会不约而同的问我们同一个问题：“信息量越大，是否意味着对事件的分析或者目标的达成越有利？”老师这么问，答案肯定是否定的。为什么呢？其实在我的印象中，没有哪个老师给了我们一个明确的答案，只是给了我们一个思考的方向，我认为有以下几点原因： 信息量越大，不意味着价值越大。举一个最简单的例子：你去饭店吃饭，希望吃到正宗的法式大餐，但是餐厅服务员却给了你一大摞中国八大菜系的菜品介绍，并且十分热情的挨个讲解给你听。这个信息量相较一般情况已经足够大，但你觉得有价值吗，是否促进了你目标的达成？我想你会恼火的去投诉这个服务员。 信息的数量虽然变大，但信息的来源并没有得到考证，也就是信息的可信度不被认可。在当今这个信息爆炸的时代，垃圾信息大量充斥在我们的生活中，可以说是随处可见：朋友圈里的“一定要看”系列文章，不良媒体的不实或夸大报道……如果信息的数量是由这些无价值甚至虚假的信息组成，那么这对我们分析问题将是一场灾难。 信息的利用需要经过清洗和整理。大量的数据收集上来，首先需要进行的就是清洗，即把不符合要求的数据信息剔除出去，接下来再进行整理，比如归类，排序，简单地比较等。所以虽然信息量大给了我们一定的分析基础，但如果不对信息进行整理和结构化，只是一堆杂乱无章的信息，那对于我们分析问题是没有任何作用的。 前面铺垫了这么多，其实我想说的是安全感也是同样的道理。对于安全感，影响它的因素很多：家庭，成长环境，性格，朋友，恋人，经历等等，正因为可以影响它的因素每个人都会拥有，所以每个人或多或少都会感觉缺乏，我问了我周围的一些朋友，不管性格如何，工作或者学习情况怎样，他们都认为自己缺乏安全感，只是程度不同。但是我们今天不分析以上的这些影响因素，我们今天从信息的角度来分析安全感。 得到有价值信息很难 人们对于不确定的事物总会感觉紧张，甚至焦虑，因为你害怕这种不确定的事物会对你的身心造成伤害，这其实就是一种安全感缺失的表现。 比如你收到了一个公司的面试通知，除非你胸有成竹或者对于结果不care，那么正常的你会感到紧张。试想，这时如果有人给了你明天的面试内容，你的紧张情绪是否会缓解很多。但在现实生活中这是几率很小几乎为零的情况，通常的情况是你漫无目的地在互联网上找各种面试信息，查找和这个公司有关的一切信息，但这些信息对于你的面试有多大的帮助，在面试之前没有人能告诉你。再比如，你爸妈让你去相亲，你们约在一个安静的咖啡馆里。因为是终身大事，你想知道他尽可能多的有价值信息，比如他人品怎样，有没有能力等等，但这些你要怎么得到呢，直接问他？通过媒人？显然通过这些渠道得到的信息都不可能是客观的，而且由于是相亲，你们共同的朋友少之又少，这又给你获得有价值信息增添了阻碍。由于得不到你想了解的信息，你有可能连进一步与他交往了解的机会都不会给双方。其实这样你就会默认他不符合你的要求，同时放大自己在寻找有价值信息过程中遇到的阻碍，进而增加你的不安全感。 不可能得到所有你需要的信息 如果我们可以完全的了解一个事物，那这个事物对我们安全感的消耗就会很低，甚至会增加我们的安全感，但实际上我们不可能完全了解一个人，一件事，任何一点没有被我们了解到的地方，都会成为我们不安全感的来源。 如果一个男生追求你，几乎每时每刻都在和你聊天，但你们在他追求你之前并没有太多交集，只停留在知道有这么一个人的水平，聊天也只是日常的一些无关紧要的话题，并没有涉及人生观、价值观等三观问题。假使这个男生很幽默，也会给你惊喜，长得也过得去。在你们聊了一个月之后他向你表白，你会答应吗？每个人对于这个问题的回答应该不尽相同，回答“会答应”的，最大的理由可能是“爱情就是需要冲动，需要勇敢，需要敢于尝试”。对于你的这个言论，我举双手赞成，但是实际上在对对方没有一定的了解上的冲动和勇敢是一种不负责任的表现，同时也会加重彼此的不安全感。因为情侣是一种相对来说比较亲密的关系，你们可能以后的人生都会和彼此相伴，在对对方没有足够了解的情况下就开始这种亲密关系，会极大地增加矛盾的产生，比如你有洁癖，他十分邋遢；你爱韩剧，他对韩剧嗤之以鼻。随着矛盾的不断累积，你们的关系有可能就会走到尽头，最终break up. 而回答“不会答应”的，不出意外就是出于认为还对对方不太了解的原因了。因为你们的聊天建立在一个虚拟的网络世界，并且没有深入的交流。他对你来说确实具有足够的新鲜感，但同时也让你没有一丝安全感。你不知道他是否具有绅士风度，是否小气，是否自以为是，长相是否真的和照片上一样……你无法完全的了解他这个人，这让你很犹豫要不要答应。如果你本身就是一个很缺乏安全感的人，那么你会倾向于不答应，反之你有可能会答应。不管怎么说，因为没有得到这个人足量的信息，由此加重了你的不安全感，而得到完全的信息数据又是不可能的，所以会导致不同程度的安全感的缺失。 所以从信息角度分析，由于不可能得到完全的信息，每个人都会或多或少的感到安全感的缺失，人们会不自主的选择不断地收集信息来填补这缺失。就像文章刚开始所说，信息量不一定代表价值，在我们忙碌于收集信息的过程中，需要善于从信息中提取有价值的东西，来帮助自己做决策，并且通过接触大量的信息，扩展自己眼界，不断提升修养、寻找生活乐趣，进而遇见更好的自己。","tags":[{"name":"随笔","slug":"随笔","permalink":"https://crystalyy.github.io/blog/tags/随笔/"},{"name":"心理学","slug":"心理学","permalink":"https://crystalyy.github.io/blog/tags/心理学/"}]},{"title":"2016--年度总结","date":"2017-01-09T08:31:26.000Z","path":"2017/01/09/年度总结/","text":"2016关键词 保研 实习 前端 成长 保研时间跨度从3月到10月，打过交道的学校主要有苏州大学，大连理工，东北大学，山东大学，华中科技大学，华南理工大学。其中给我留下比较好印象的是苏大，华科。不知道是不是在南方待久了，还挺喜欢南方的气候和生活方式的。但是，结果往往在人的意料之外。想想刚进大学时，寝室的妹子基本都在说以后不管考研还是就业都一定要回到家乡去，但自己却说要去一个自己喜欢的地方生活和学习，山东自己有点呆腻了，不想回去。三年后，偶然的政策改变，让我这个本来想去找工作的人去读了研究生，也让我回到了山东。 实习 一个多月的检察院档案整理 当时选择去这个实习，有两个目的。一是在学校学习效率太低，想换个环境；二是有些东西想买，自己挣点钱提升一下自己生活品质。一个月再加一个周的实习，接触的都是档案相关的东西。刚开始还觉得挺新奇，也学了一些档案相关的知识，后来就是很枯燥乏味没有挑战性的重复工作了，再加上自己对于档案相关的工作并不感兴趣，所以实习的后期很难熬，甚至因为很闲，我一度怀疑人生，连学习都没办法正常进行。 百度实习面试 虽然经过学长的内推，我得到了面试机会，也成功进入到了三面，但最终还是没有能进。在等结果的那几天，自己特别情绪化，有时中午从图书馆去食堂吃饭，路上听着音乐眼睛里都会充满泪水，还记得当时听的是“原谅”这首歌。多谢闺蜜——逗比丹，告诉我没有被录用，或许并不是一件坏事，以后去百度的机会还有，明年的毕业可就一生只有一次啊。确实是的，想想自己为了能去百度实习，答应了全职实习六个月的要求，这中间放弃了寒假，毕业旅行，毕业季，或许连毕业答辩都不能认真完成。喔，想到这里，又觉得自己放弃了那么多，百度竟然还不要我，又伤心了o(╯□╰)o。 具体面试经历详见：http://blog.csdn.net/sinat_27088253/article/details/53705502 前端越来越感觉自己对于前端是真爱，就算保研成功，研究生导师说了让学习图形学相关的知识，熟悉c/c++,但自己依然死性不改的接着学前端，进了坑就出不来的感觉。这一年主要的学习 百度前端学院春季学期的任务完成 freecodecamp课程 csdn写了28篇博文 接触了一点前端自动化，包管理的工具（grunt，npm） JavaScript高级程序设计细读（发现因为保研的时候把java认真的过了一遍，对JavaScript的学习有很大帮助） 习惯看英文文档 喜欢发现问题后，在github上用issue“骚扰”作者，不过因为提问把问题说明的比较清晰，而且还加入了自己尝试过的解决办法，还没有作者不搭理我的情况出现O(∩_∩)O~~(此处不限于前端) 微博，知乎上关注了一堆前端开发的程序员 成长大学就要接近尾声，回望过去的时间，算是问心无愧，也没有太耿耿于怀，想要重新来一次的事情。每一年都在成长，经历的多了，心境自然就变了。今年经历了太多选择和被选择，在每次徘徊犹豫中，总期望自己能做一个最好的抉择。其实现在看来，哪里有最好的，只不过是另一条道路罢了，只要目标不变，内心坚定，一次选择不会左右你整个人生。对于情商的锻炼也是一个必须的成长。随着年岁的增长，敞开心扉变得越来越难，不知是懂得了人心险恶还是失去了和人交心的愿望。爱情也好，友情也罢，你在其中扮演的角色并没有那么的非你不可，但你也不是可有可无。就像你有三支不同粗细的笔，在写贺卡的时候选用粗的那一款比较可爱，但如果没有，用中等粗细的笔代替也未尝不可，只是变了一种风格而已。所以自己其实在别人眼里并没有那么重要，问问自己，你真正觉得重要的“别人”又有几个？但也不要妄自菲薄，因为你会发现在你难过时还是会有人愿意伸出援手，因为人们心中都有一杆秤，会根据人员的不同分配可提供的不同程度的援助，不超额就可以。渐渐发现为了别人的眼光而活是多么的愚蠢，人生宝贵，多分点时间做自己吧。之前一直想要去工作是想要实现经济的独立，但在检察院实习过后，发现工作不仅仅是工作，更多是你生活的一部分，你的成就感，满足感很大程度上来源于工作。这份工作什么性质，工资多少，有没有前途，对于你来说并没有那么重要，重要的是你热爱，不管你热爱的是这份工作带来的成就感还是给予你生活质量的提升，只要有你热爱的地方，并愿意为他花费你最宝贵的时间，就是最好的工作。 结语一年匆匆而过，2016年年初去西安玩耍的场景还历历在目，如今又是新的一年。 这一年最开心的事应该算是认识了我女神羡辙,她给了我很多正能量的影响，其中包括重新开始坚持读书，这一年粗略数了数一共读了19本左右的书；不断充实自己的生活，多学点新东西等等 最喜欢听的歌是麦家瑜的“好得很”，其中一句歌词“没有了一切，有修养”写的很让人感动 最难忘的一件事是自己一个人夜游苏州，很美。 最遗憾的一件事是和以前的朋友没有时间联系，不知会不会渐行渐远 截止到现在对明年的期望（年度计划太难写，我最多只能写到月计划） 开心 导师能去青岛，待人好。所在的实验室有帅哥就更好了，逃~ 保持学习 游一游杭州 支教 经常制定计划，在学校时每天完成每日计划和每日总结以及每月的月计划和月总结 研究生开头顺利","tags":[{"name":"秋实","slug":"秋实","permalink":"https://crystalyy.github.io/blog/tags/秋实/"},{"name":"年度总结","slug":"年度总结","permalink":"https://crystalyy.github.io/blog/tags/年度总结/"}]},{"title":"保研之路","date":"2016-10-08T13:05:21.000Z","path":"2016/10/08/保研之路/","text":"写在前面距离29号保研结果确定已经过去了十天左右的时间，本来打算结果确定之后就开始写一写保研过程中发生的事，遇到的坑等，但因为最后的等待阶段有些崩溃，第二天就从黄牛手中买了票，和国庆节出游的人挤着，没拿电脑回家修养了几天。前天回到学校后，收拾收拾准备了一个实习的面试，一直没找到时间写，今天晚上刚好空出来，打算给自己的保研生涯画上一个有意义的句号，希望能给后来保研的同学一个参考。 结果：湘潭大学（双非）— 山东大学（985,211） 基本情况： 无国奖，无比赛，有未完成的大创项目，成绩3/74，连续两次甲等奖学金，前端项目较多 早准备可能大家在和上届的学长学姐交流的时候，会有一种保研很容易的错觉。我在三四月份的时候和上一届的一个保研到中南大学管理科学与工程的学姐聊天时，她告诉我保研没有想象中的那么难，当时导师就给她打了一个电话，聊了聊，聊得来就过了。其实现在看来，这些话真的不假，但太过片面：导师和你聊得来确实会增加录取的可能性，但导师收研究生是为了什么？聊天吗？显然不是吧，还是需要能真正帮他做事情的人，所以专业知识是必须要认真复习的。记得和清华学电子的一个已毕业的硕士研究生哥哥聊天，请教他保研相关的问题，我跟他说了我的顾虑，什么双非啊，专业不对口啊，没有比赛和国奖什么的，这些他都说没有太多的影响。我又跟他说，前两天去面试南开，结果老师问的专业问题有的没能回答出来。他马上打断我说基本的专业知识你都不会，导师招你进去干什么！说的我脸上火辣辣的，才知道聊了那么久他一直在给我树立信心，没有提基础的专业知识的事情，是因为在他眼里，这都是不用说必须要熟练掌握的。 因此，我认为的早准备是需要从大三下寒假开学三月份左右就要着手准备。主要可以分为三个阶段 了解保研基本过程 画了一个程序流程图，不懂的可以评论交流~ 夏令营的要求较高（毕竟学校包吃包住，还报销来回车票），像我报名了很多学校的夏令营，最后就只过了一个苏州大学的，所以如果夏令营没有通过也不要气馁，专心复习专业课就可以。 预录取相对于夏令营要求就低了很多，我报名了将近十个学校的预录取，过了有七八个吧，只有像清北复交这种特别牛逼的学校才会在一定程度上刷人，不过刷人也不厉害，我知道一个湖北大学的男生，最后通过预报名去了复旦。 最后不管你是通过夏令营还是预报名获得的录取资格，都必须再在国家推免服务系统中再次报名，学习给你发送预录取通知，接收之后才算正式录取。 三个志愿是相互独立的，每个志愿填报后的48小时过后可以修改，系统一般会开放一个月左右。 准备专业课 准备专业课是贯穿在整个保研过程中的重头戏，而且时间紧任务重，因为基本所有的专业课都要复习，就算不能深入了解每个知识点，也要对每个知识点有个大概的印象。我周围有的朋友也要保研，但可能是觉得保研相对来说比较轻松吧，就没怎么复习专业课，这样如果想冲击更好的学校就会有很大风险。所以暑假一定要好好利用起来，要想到保研后会有时间出去玩，暑假就先不要玩了。尤其对于计算机专业，很多学校都有机试，所以还不能只单纯看理论，也要分出时间来练习编程。比如山大的机试用的是ccf的题，我因为之前没接触过，所以在去考试前的一个小时还在熟悉题目，看解题思路，写程序。事实证明，“临时抱佛脚”还是有用的，刚好考试时有一道原题O(∩_∩)O。 搜集各个学校夏令营信息，及时填报材料报名参加 夏令营信息可以去保研论坛寻找，多加几个保研相关的群，里面会有一块保研的小伙伴或者已经保研的学长学姐给予建议。及时关注心仪学校的官网。 报名夏令营，一定要根据自己的水平分层次填报：冲击的好学校，中等，肯定能上的。其实这个层次很难把握，我觉得我一直到保研的最后阶段才对这个层次有了一定的认识，开始填报的时候我采取的是海投的策略。最好在夏令营阶段拿到一个保底的学校，以免最后国家推免系统开放后自己还是一个offer没有的状态，这样就会很尴尬。不过如果没拿到也不用着急，好好准备预报名。 提高与人交流的能力保研的过程不仅是智商和比拼，还有很多情商的较量。我想主要分为两大类来讨论：与一同保研的同龄人的交流以及与导师的交流。 同龄人 在夏令营或者预报名的复试过程中都会遇到很多一同保研的小伙伴，他们是你竞争对手的同时，更多的是你潜在的朋友。与他们友好和谐的相处与交流会给你带来莫大的帮助，甚至你会想用很幸运遇到他们来形容。我属于相对外向的女生，在苏大夏令营的三天，可能因为是同龄人，所以大家相处的非常好，我结实了一个男生一个女生，至今都还有联系。尤其是那个男生，因为我是跨专业保研，很多资源，很多信息都不知道，他给了我很大的帮助，在选学校和复习专业课方面都给了我很多合理化的建议和帮助，在去华科见导师时还在武汉接待了我，真的非常感谢他。所以一定要锻炼自己与人交际的能力，能够保研的说明都是有过人之处，这么优秀的朋友为何不多交几个呢？ 联系导师 对于联系导师，我现在想想发现除非你特别优秀，不然太早联系导师导师也不会给你肯定的答复，当然，像华南理工计算机学院这种必须联系到导师才给复试资格的学校除外。不过自己想去的学校最好还是联系下，就算不能得到肯定回复，万一过了，就可以顺理成章的和老师交流了。我在山大的导师就是之前联系了下，导师没有给肯定回复，被录取之后，再联系就直接要了。 至于怎么联系导师，一般都是通过邮件，非常想去时也可以电话联系。导师信息在官网上都有，要自己去寻找。联系导师的邮件要怎么写，确实需要斟酌。我也是在网上参考了很多，最后在保研论坛发现了一个觉得还挺好的，我分享一下吧http://pan.baidu.com/s/1kVFGBEv 多与少的权衡不管在夏令营阶段还是预报名阶段，都没有学校个数的限制。有得同学会怕最后落空，而海投，比如我。但海投会有一个很大的弊端，你要同时了解多所学校的信息，而且准备也缺乏针对性。有切身体会的我，有一天中午因为搜集了一上午相关学校的信息，但并没有得到太多有价值的东西，同时又没有复习专业课（当时时间已经很紧），而近乎崩溃，在给妈妈打电话时差点哭出来。最后听了妈妈的建议，我给自己选择的学校结合自己想去的程度和能录取的可能性排了一个序，选出了排名前三的学校，之后就开始有针对性的准备这三所学校，效率也提高了很多。 所以海投有利有弊，我的建议是开始海投，避免自己想去这个学校时，这个学校的报名时间已经截止（我整个保研过程前前后后换了有十多所学校，有自己的原因也有学校的原因）。到某一个合适的时间点，我的建议是八月底九月初选出自己心中排名的前三名学校，如果觉得有点少，那可以先选出来前五，但之后一定要再次缩减到三个。人的精力是有限的，五个学校同时准备按照我的经验太多了，应付不过来。 等与放弃的选择很多学校在9月28号（今年的开放时间）国家推免系统开放录取填报系统之后，当天就要求你确定录取。如果这个学校是你一直想去的，那没什么纠结的。但如果这个学校是你的垫底或者不是最中意的学校，你想冲击一下更好的，但那个学校在28号并不能给你录取或者不录取的通知。到底等不等？这种情况在保研最后的选择阶段太容易发生了，像我拿到了苏大，山大的录取，但因为自己想在南方发展，所以还想冲击一下华科。山大的招生办老师发来短信说必须在28号发送待录取通知后两小时之内确认，我在经历了一系列漫长的思想斗争后，这儿还是要感谢一下那个男生和我的妈妈，他们都给了我很大的支持，妈妈说不要有后悔，想试就试一下吧。于是我忍痛在待录取通知两小时过后没有点击确认，提心吊胆的等华科。中间给华科的老师打了电话，老师说29号尽量搞完，我又跟他说了一下自己的基本情况，他说应该能录取。到第二天29号中午依然没有收到通知，我又打电话给华科的老师，老师说系统很卡，不确定今天还能不能出结果。我这时已经近乎崩溃，因为华科如果不要我，我就要直接落到苏大（没有说苏大不好的意思，自己还是很喜欢苏大的，不过研究方向不是我所感兴趣的，所以可能就会不太想去）我听那个男生的建议，三点半又去问了一下山大的老师（系统上显示的是16:00之前确认就有效），老师说可以录取。我又再次陷入了纠结，问了朋友，问了家人，但最后的决定还是要自己做。努力让自己平静下来想了想，发现山大的研究方向是自己喜欢的，而且山大的人机交互很强，自己在纠结了一阵之后，点击了山大的待录取确认。 确认之后整个人还是蒙的，真的像做梦一样，保研就这样结束了。在等与放弃之间我最终选择了放弃冲击华科，不能说这个选择对还是不对，因为那个在苏大认识的男生也在等，他没有放弃，最终去了华科。因为这是一个人生抉择，要冷静下来听从自己内心的选择，选择了就不要后悔。现在我其实很庆幸去了山大，华科本来答应的专硕也是培养三年最终因为学校不同意而作罢，山大这边却可以有三年的时间学习，而且昨天联系导师，导师说可以提前去实验室，我打算过两天就去那边实验室学习了。 写在最后现在自己已经平静了，如果刚保研结束我可能会很激动的写最后这个总结。 保研对于我来说一半是自己的努力，一半是别人的帮助。有院里老师每次都很热情的帮我签字盖章写推荐信，有好朋友在我想放弃时的鼓励，有家人无条件的支持，有没见过面的朋友的帮助还有面试我的南开导师的指导（虽然没拿到南开的offer，但老师却给了我很认真的保研建议），真的很感谢。 最后还想感谢保研的过程中自己的成长，更加的独立和自信。 最后的最后，希望以后的保研人一切顺利。","tags":[{"name":"随笔","slug":"随笔","permalink":"https://crystalyy.github.io/blog/tags/随笔/"},{"name":"保研","slug":"保研","permalink":"https://crystalyy.github.io/blog/tags/保研/"}]}]